Repository: mg-khawaja/stuttering
Catalog: Stuttering/Stuttering/Stuttering/Resx/StutteringResources.*.resx
Languages: ur

source: 10 min
ur: 10 منٹ

source: 1 min
ur: 1 منٹ

source: 2 min
ur: 2 منٹ

source: 3 min
ur: 3 منٹ

source: 4 min
ur: 4 منٹ

source: 5 min
ur: 5 منٹ

source: 6 min
ur: 6 منٹ

source: 7 min
ur: 7 منٹ

source: 8 min
ur: 8 منٹ

source: 9 min
ur: 9 منٹ

# attempt
source: Please attempt the question!
ur: براہ کرم سوال کا جواب دیں!

# attempt_all
source: Please attempt all questions!
ur: براہ کرم تمام سوالوں کے جواب دیں!

source: Breathing Practice
ur: مشق کرتے ہیں

source: Breath In
ur: سانس لیں

source: Breath Out
ur: سانس چھوڑیں

source: Chapters
ur: ابواب

# emotional_heading
source: Emotional Reactions
ur: جذباتی ردِعمل

# emotional_para
source: People who stutter may experience a variety of negative emotional reactions to the fact that they have difficulty in speaking. Examples include feelings of embarrassment, anxiety, and shame, which can lead to tension and struggle while speaking or attempts to avoid talking altogether.
ur: ہکلاہٹ کرنے والے افراد مختلف منفی جذبات کا تجربہ کرتے ہیں۔ان منفی جذبات میں شرمندگی اور بےچینی شامل ہیں جنکی وجہ سے انہیں بولنے کے دوران تناؤ اورجدوجہد کاسامناکرناپڑتا ہے۔ اسکے باعث بعض اوقات وہ زیادہ گفتگوسے اجتناب کرتے ہیں

source: English
ur: انگریزی

source: Error
ur: خرابی

source: Exhale
ur: سانس چھوڑیں

# facts_heading
source: Facts about Stuttering
ur: ہکلاہٹ کے حقائق

# facts_para_1_1
source: Stutters can
ur: ہکلانے والے افراد

# facts_para_1_2
source: learn to overcome
ur: ہکلاہٹ پرقابو

# facts_para_1_3
source: stuttering
ur: پانا سیکھ سکتے ہیں

# facts_para_2_1
source: Most stutterers
ur: ہکلانے والے زیادہ ترافراد

# facts_para_2_2
source: don’t stutter when alone
ur: اکیلے میں نہیں ہکلاتے

# facts_para_2_3
source: as they feel relaxed and focused and all brain resources are directed towards speech but among people the stuation is difficult. They feel stressed leading to stuttering
ur: ہکلاتے کیونکہ وہ باآسانی اپنی توجہ بولنے پرمرکوز کر سکتے ہیں لیکن جب وہ لوگوں کے درمیان ہوتے ہیں تو توجہ مرکوز کرنا مشکل ہوتاہے اوروہ تناؤ محسوس کرتے ہیں جسکے نتیجے میں وہ ہکلاتے ہیں

# facts_para_3_1
source: There are
ur: کچھ صورتِ حال میں ہکلانے والے افراد کو

# facts_para_3_2
source: situations when people don’t stutter
ur: ہکلاہٹ نہیں ہوتی

# facts_para_3_3
source: like singing, speaking in unison with people or whispiring while speaking on phone, talking to a stranger or public speaking may enhance the stuttering.
ur: جیسا کہ گانا گاتے ہوئے،لوگوں کے ساتھ ہم آہنگی میں بولتے ہوئے، سرگوشی میں بولتے ہوئے یا فون پربات کرتے ہوئے البتہ کسی اجنبی سے بات کرنایا عوامی سطح پربولنا ہکلاہٹ کو بڑھا سکتا ہے

# facts_para_4_1
source: There are many
ur: بہت سے

# facts_para_4_2
source: famous people
ur: مشہورلوگ ہکلاتے ہیں

# facts_para_4_3
source: including ators scientists, musicians and politicians who stutter such as US President Joe Biden, Marilyn Monroe, James Earl Jones, Emily Blunt, Shaquille O’Neal, Darwin, Whinston Churchill. Actor Hiritik Karoshan and Rani Mukharji.
ur: جن میں اداکار،موسیقار، سائینسدان اور سیاستدان شامل ہیں۔مثلاً امریکہ کے صدر جو بائیڈن، مارلن منرو، جیمز ارل جانز، ایملی بلنٹ، شکیلے او نیل، ڈارون،ونسٹن چرچل اور اداکاررانی مکھرجی اورہریتکروشن شامل ہیں

# hierarchy_heading
source: Hierarchy
ur: درجہ بندی

source: Hold 1
ur: سانس روکیں 1

source: Hold 2
ur: سانس روکیں 2

source: Hold On
ur: سانس روکیں

source: Inhale
ur: سانس لیں

source: Instructions
ur: ہدایات

# journey_heading
source: The Journey
ur: سفر

source: Language
ur: زبان

# lets_move
source: Let's move on to some
ur: آئیے سانس لینے کی کچھ

# management_heading
source: Management
ur: نظم ونسق

# management_para
source: Treatment is most helpful when it focuses on more than just fluent speech. Since stuttering is more than just stuttering, treatment for stuttering should address more than just the observable speech disfluencies. Addressing the whole disorder is the key to helping people reduce the impact of stuttering on their lives Most people who stutter can speak without stuttering when they talk to themselves and when they sing or speak in unison with someone else, when they focus on more than just fluent speech and practice it more and more as they can.
ur: ہکلاہٹ کا علاج اس وقت زیادہ موثر ہوتا ہے جب توجہ صرف بولنے کی روانی پرمرکوز کی جائے۔چونکہ ہکلاہٹ بولنے میں روانی کی خرابی ہے لہذا توجہ بھی روانی میں بولنے کے دوران ہونے والی خرابیوں پرمرکوزکرنی چاہیے۔اس عارضے کو دورکرنالوگوں کی زندگی پرہونے والے منفی اثرات کو کم کرتا ہے۔بہت سے لوگ جوہکلاتے ہیں وہ گاناگانے کے دوران،خود کلامی اور کسی دوسرے کے ساتھ مل کر بولتے ہوئے کم ہکلاتے ہیں۔ جب وہ اپنی توجہ صرف روانی کے ساتھ بولنے پر مرکوز کرتے ہیں اور جتنا ہو سکے زیادہ سے زیادہ مشق کرتے ہیں

# menu_assessment_close
source: Self Assessment -
ur: خود تشخیص -

# menu_assessment_open
source: Self Assessment +
ur: خود تشخیص +

# menu_breathing
source: > Breathing Exercises
ur: > سانس لینے کی مشقیں

# menu_evaluation
source: > Self Evaluation of Fluency
ur: > بولنے میں روانی کا جائزہ

# menu_exit
source: Exit
ur: باہر نکلیں

# menu_flexible
source: > Flexible rate of speech
ur: > روانی سے بولنے کی شرح

# menu_management_close
source: Self Management -
ur: سیلف مینجمنٹ -

# menu_management_open
source: Self Management +
ur: سیلف مینجمنٹ +

# menu_onset
source: > Easy Onset
ur: > آسان بات چیت کا آغاز

# menu_rater
source: > Stutter Rater
ur: > ہکلانے کی فیصد میں درجہ بندی

# menu_rating
source: > Self Rating of Stuttering
ur: > ہکلانے کی خود درجہ بندی

# menu_settings
source: Settings
ur: ترتیبات

source: Mostly
ur: زیادہ تر

# motivaional_para_1
source: The one thing I’ve learned is that stuttering in public is never as bad as I fear it will be (John Stossel)
ur: ایک چیز جومیں نے سیکھی ہے وہ یہ ہے کہ عوام میں ہکلانااتنابھی برا نہیں ہے جتنا کہ مجھے ڈر تھا کہ ایسا ہو گا۔(جان سٹوسل)

# motivaional_para_2
source: Keep in mind that… the less you avoid words and situations, the less you will stutter in the long run (J.D. Williams)
ur: ذہن میں رکھیں کہ جتنا آپ الفاظ اور حالات سے کم گریز کریں گے اتنا ہی آپ کم ہکلائیں گے۔(جے ڈی ولیمز)

# motivaional_para_3
source: Stuttering is ok because what I have to say is worth repeating (Anonymous)
ur: ذہن میں رکھیں کہ جتنا آپ الفاظ اور حالات سے کم گریز کریں گے اتنا ہی آپ کم ہکلائیں گے۔(جے ڈی ولیمز) ۔ہکلانا ٹھیک ہے کیونکہ جومجھے کہنا ہے وہ دوہرانے کے قابل ہے۔(اجنبی)

# motivaional_para_4
source: I think that’s why I put my energy in making the Music (Kendrick Lamar)
ur: مجھے لگتا ہے کہ ہکلاہٹ کی وجہ سے ہی میں اپنی توانا ئی موسیقی بنانے میں لگاتا ہوں۔(کینڈرک لامر)

# motivaional_para_5
source: Learning how to help yourself should be the goal of every stutter (Malcom Fraser)
ur: اپنی مدد کرنے کاطریقہ سیکھنا ہرہکلانے والے کامقصد ہونا چاہیے۔(میلکوم فریزر)

# motivational_heading
source: Motivational Quotes
ur: تحریکی اقتسابات

source: Never
ur: کبھی نہیں

# nothing_heading
source: Nothing is Wrong with Stutters
ur: ہکلاہٹ میں کچھ غلط نہیں ہے

# nothing_para
source: People aren’t doing anything wrong when they stutter; they are simply trying to talk, just like anyone else would do. If they feel embarrassed about their speech or ashamed of being different, then they are more likely to struggle with speaking or try to avoid talking. This makes the problem worse and increases the impact of the disorder. When people know that it is okay to stutter, then they can communicate more freely and more easily. They can say what they want to say, even if they sometimes say it disfluently. Thus, acceptance of stuttering is the key to successful communication
ur: لوگ جب ہکلاتے ہیں تو دراصل وہ کچھ غلط نہیں کررہے ہوتے بلکہ وہ عام لوگوں کی طرح بات کرنے کی کو شش کر رہے ہوتے ہیں۔اگر وہ اپنی ہکلاہٹ پر شرمندگی محسوس کریں تو انہیں بولنے میں مشکل کاسامنا کرنا پڑتا ہے۔ اس سے انہیں شرمندگی محسوس ہوتی ہے اور بولنے میں مذید خرابی کا سامنا کرنا پڑتا ہے۔آخر کاروہ بات کرنے سے بچنے کی کوشش کرنے لگتے ہیں۔البتہ جب انہیں یہ یقین دلایا جائے کہ ہکلانا ٹھیک ہے تو وہ زیادہ آزادانہ اور آسانی سے بات چیت کرنے کے قابل ہوسکتے ہیں۔ وہ آسانی سے وہ سب کچھ کہہ سکتے ہیں جووہ کہنا چاہتے ہیں۔بلاشبہ ہکلاہٹ کو تسلیم کرنا ہی کامیاب بات چیت کی کنجی ہے

source: Occasionaly
ur: کبھی کبھار

source: Often
ur: اکثر

source: OK
ur: ٹھیک ہے

# overview
source: Stuttering Overview
ur: ہکلاہٹ کا جائزہ

# overview_definition
source: Stuttering is a speech disorder that involves frequent and significant problems with normal fluency and flow of speech.
ur: ہکلاہٹ ایک ایسا مرض ہے جس میں افرا کو روانی سے بولنے میں متواتر اور واضح مسائل درپیش ہوتےہیں

# rater_inst_d
source: Press D button when you stutter while speaking
ur: جب آپ بولتے ہوئے ہکلاتے ہیں تو D بٹن دبائیں۔

# rater_inst_reset
source: Press RESET button to reset the timer and record
ur: ٹائمر اور ریکارڈ کو دوبارہ ترتیب دینے کے لیے RESET بٹن دبائیں۔

# rater_inst_s
source: Press S button when you spoke a syllable
ur: جب آپ کوئی حرف بولیں تو S بٹن دبائیں۔

# rater_inst_start
source: Press START button to start the timer
ur: ٹائمر شروع کرنے کے لیے START بٹن دبائیں۔

# rater_inst_stop
source: Press STOP button to stop the timer
ur: ٹائمر کو روکنے کے لیے STOP بٹن دبائیں۔

source: Save
ur: محفوظ کریں

source: Secs
ur: سیکنڈ

# self_eva_q1
source: How Fluent was I?
ur: میرے بولنے میں کتنی روانی تھی؟

# self_eva_q2
source: How often did these features occur in my speech? • Repitition • Blockage • Hesitation • Prolongation
ur: میرے بولنے میں مندرجہ زیل خصوصیات کتنی مرتبہ آئیں؟ 1۔ دہرانا (Repetition) 2۔رکاوٹ(Blockage) 3۔ ہچکچاہٹ (Hesitation) 4۔ طول دینا (Prolongation)

# self_eva_q3
source: How often did I use slowed speech?
ur: میں نے کتنی بار سست تقریر کا استعمال کیا؟

# self_eva_q4
source: How effective was my communication?
ur: میری بات چیت کتنی موثر تھی؟

# self_eva_q5
source: Were there any obstacles in communicating effectively?
ur: کیا مجھے موثر طریقہ سے بات چیت کرنے میں رکاوٹ رہی تھی؟

# self_eva_q6
source: Was there neck stiffness during my speech?
ur: کیا میری بات چیت کے دوران گردن میں تنا ؤ تھا؟

# self_eva_q7
source: Have I observed rapid eye blinking, jaw jerking, foot taping and/or other involuntary movements during the speech?
ur: کیامیں نے بات چیت کے دوران تیزی سے آنکھیں جھپکنے ، جبڑے کو ہلانے ، پاؤں ہلانے ، سر جھٹکنے ، انگلیاں چٹخنے اور/یا دیگر غیر ضروری حرکات کا مشاہدہ کیا ؟

# self_rating_instruction
source: 1 will be considered as less rate of suttering and 10 as severe intensity
ur: " 1" کو ہکلانے کی کم شرح اور" 10" کو شدید شدت کے طور پر سمجھا جائے گا

# self_rating_q
source: Rate your stuttering intensity on the scale from 1 – 10
ur: ہکلانے کی شدت کو مارک(Mark) کریں

source: Settings
ur: ترتیبات

# set_time
source: Set time duration
ur: وقت کی مدت مقرر کریں

source: START
ur: شروع

# start_stutter
source: Please start the stutter rater first!
ur: براہ کرم پہلے stutter rater کو چلائیں!

# stop_stutter
source: Please stop the stutter rater first!
ur: براہ کرم پہلے stutter rater کو بند کریں!

# title_assessment
source: Self Assessment
ur: خود تشخیص

# title_breathing
source: Breathing Exercises
ur: سانس لینے کی مشقیں

# title_evaluation
source: Self Evaluation of Fluency
ur: بولنے میں روانی کا جائزہ

# title_flexible
source: Flexible rate of speech
ur: روانی سے بولنے کی شرح

# title_onset
source: Easy Onset
ur: آسان بات چیت کا آغاز

# title_rater
source: Stutter Rater
ur: ہکلانے کی فیصد میں درجہ بندی

# title_rating
source: Self Rating of Stuttering
ur: ہکلانے کی خود درجہ بندی

# title_settings
source: Settings
ur: ترتیبات

source: Total
ur: کل تعداد

# triggers_heading
source: Triggers of Stuttering
ur: ہکلاہٹ کے محرکات

# triggers_para
source: Stuttering may be worse when the person is excited, tired or under stress, or when feeling self-conscious, hurried or pressured. Certain situations such as speaking in front of a group or talking on the phone can be particularly difficult for people who stutter.
ur: ہکلاہٹ اس وقت شدید ہو سکتی ہے جب ایک شخص زیادہ پر جوش، تھکا ہوا، کسی دباؤ یا تناؤ کا شکار ہو یا جلدی بولنے اور بات ختم کرنے کی کوشش کرے۔کچھ حالات مثلاًدو سے زائد افراد کے گروپ سے بات کرنا یا فون پر بات کرنا ہکلاہٹ کرنے والے افراد کیلئے مشکل ہوسکتا ہے

source: Urdu
ur: اردو

# varies_heading
source: Stuttering Varies
ur: ہکلاہٹ میں اتار چڑھاؤ

# varies_para
source: People do not stutter the same way or the same amount in all situations. Variability can also confuse parents, teachers, and peers, for they may wonder why a person is fluent in one situation but struggles in another. It is not because the speaker is not trying hard enough; it is just because stuttering varies.
ur: ہکلاہٹ کرنے والے افراد تمام حالات میں ایک ہی طرح یا ایک ہی جتنا نہیں ہکلاتے۔ ہکلاہٹ میں تغیرات بعض اوقات انکے والدین اوراساتذہ کوالجھادیتے ہیں کہ وہ کیوں ایک صورتِ حال میں تو روانی میں بولتا ہے مگر دوسرے میں کیوں ہکلاتا ہے۔یہ اسلیئے نہیں ہوتا کہ و ہ ایک صورتِ حال میں تو روانی سے بولنے کی کوشش کرتا ہے مگر دوسری صورتِ حال میں نہیں بلکہ یہ اسلئے ہے کہ ہکلاہٹ ہر صورتِحال میں بدلتی رھتی ہوتی ہے

source: Lock Type
ur: لاک ٹائپ

source: Lock
ur: لاک

source: Change Pin
ur: چینج پن

source: Change Pattern
ur: چینج پیٹرن

source: Self Management
ur: سیلف مینیجمنٹ

source: Self Assessment
ur: خود تشخیص

source: Chapter
ur: باب

source: Level
ur: لیول

source: Stats
ur: اعدادوشمار

# new_pin
source: Enter new Pin
ur: نیا پن درج کریں

source: Enter again
ur: دوبارہ درج کریں

# enable_pin
source: Enter Pin to enable
ur: پن درج کریں

# disable_pin
source: Enter Pin to disable
ur: پن درج کریں

# pin_description
source: Do not forget this pin. If you forget this pin, you won't be able to login to the app again.
ur: اس پن کو مت بھولنا۔ اگر آپ اس پن کو بھول جاتے ہیں، تو آپ دوبارہ ایپ میں لاگ ان نہیں ہو سکیں گے۔

# new_pattern
source: Draw new Pattern
ur: نیا پیٹرن بنائیں

source: Draw again
ur: دوبارہ بنائیں

source: Pin
ur: پن

source: Pattern
ur: پیٹرن

source: Go
ur: ٹھیک ہے
